app/controllers/timelines_controller.rb

  def index
    user = User.find(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)