app/controllers/users_controller.rb

INSERT INTO "users" ("tw_token", "created_at", "tw_screen_name", "updated_at", "tw_secret") VALUES('', '2010-10-06 21:32:30', 'dot429trends', '2010-10-06 21:32:30', '')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-10-06 21:57:50', "tw_token" = '', "tw_secret" = '' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."tw_screen_name" = 'timesarrow') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-10-06 21:56:19', "tw_screen_name" = 'timesarrow', "tw_token" = '17849214-A18KQ3IF6yghxzf1mfo0ADPV3jABVhXE4hwc4rDtX', "tw_secret" = 'Vt6ZFf7qDS2ScornS9JnbvKNa5ZIkyZXEVx8Gq70qA' WHERE "id" = 1
---
  def finalize
    oauth.authorize_from_request(session['rtoken'], session['rsecret'], params[:oauth_verifier])

    session['rtoken']  = nil
    session['rsecret'] = nil

    profile = Twitter::Base.new(oauth).verify_credentials
    user    = User.find_by_tw_screen_name(profile.screen_name)

    user.update_attributes({
      :tw_screen_name => profile.screen_name,
      :tw_token => oauth.access_token.token,
      :tw_secret => oauth.access_token.secret,
    })